# Data Structure in pandas

In [3]:
import pandas as pd

In this cell we find the value on index and convert a list in to series

In [6]:
x = [1,3,4,5,9,6,6,6,6,7,8,9,9,9,9,10]
s = pd.Series(x)
print(s)
print(s[5])
print(s.dtype)
print(type(s))

0      1
1      3
2      4
3      5
4      9
5      6
6      6
7      6
8      6
9      7
10     8
11     9
12     9
13     9
14     9
15    10
dtype: int64
6
int64
<class 'pandas.core.series.Series'>

Change the datatype and change indexing

In [8]:
x = [1,3,4,5,9,6,6,6,6,7,8,9,9,9,9,10]
s = pd.Series(x, index=['a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p'], dtype='float64')
print(s)
print(s['d'])

a     1.0
b     3.0
c     4.0
d     5.0
e     9.0
f     6.0
g     6.0
h     6.0
i     6.0
j     7.0
k     8.0
l     9.0
m     9.0
n     9.0
o     9.0
p    10.0
dtype: float64
5.0

In [10]:
dic = {"name":["python","java","c","c++"],
       "fees":[2000,4000,3000,5000],
       "duration":["2 months","3 months","4 months","5 months"],
       "pos":[1,2,4,3],
       "por":[12,13,14,15]
       }
ser = pd.Series(dic)
print(ser)

name                          [python, java, c, c++]
fees                        [2000, 4000, 3000, 5000]
duration    [2 months, 3 months, 4 months, 5 months]
pos                                     [1, 2, 4, 3]
por                                 [12, 13, 14, 15]
dtype: object

In [11]:
s = pd.Series(12,index=[1,2,3,4,5,6,7])
print(s)

1    12
2    12
3    12
4    12
5    12
6    12
7    12
dtype: int64

In [12]:
s1 = pd.Series([12,3,4,1,44,56,12,345,67])
s2 = pd.Series([1,2,34,566,32])
print(s1+s2)

0     13.0
1      5.0
2     38.0
3    567.0
4     76.0
5      NaN
6      NaN
7      NaN
8      NaN
dtype: float64

# Basics of of DataFrame

In [13]:
l = [1,2,3,4,5,6,7,8,9]
a = pd.DataFrame(l)
print(a)

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [20]:
dic = {'name':['Ashish','Dev','Ankit','Anmol','Vivek','Akash'],
       'age':[22,33,41,24,56,26],
       'Marks':[88,76,90,85,79,95],
       'City':['Delhi','Noida','Mumbai','Chennai','Kolkata','Bangalore']
       }
dataframe = pd.DataFrame(dic, index=['a','b','c','d','e','f'])
print(dataframe)

     name  age  Marks       City
a  Ashish   22     88      Delhi
b     Dev   33     76      Noida
c   Ankit   41     90     Mumbai
d   Anmol   24     85    Chennai
e   Vivek   56     79    Kolkata
f   Akash   26     95  Bangalore

## Access the elements from dataframe

In [22]:
dic = {'name':['Ashish','Dev','Ankit','Anmol','Vivek','Akash'],
       'age':[22,33,41,24,56,26],
       'Marks':[88,76,90,85,79,95],
       'City':['Delhi','Noida','Mumbai','Chennai','Kolkata','Bangalore']
       }
dataframe = pd.DataFrame(dic, index=['a','b','c','d','e','f'], columns = ['name','Marks'])

print(dataframe)

     name  Marks
a  Ashish     88
b     Dev     76
c   Ankit     90
d   Anmol     85
e   Vivek     79
f   Akash     95

In [24]:
dic = {'name':['Ashish','Dev','Ankit','Anmol','Vivek','Akash'],
       'age':[22,33,41,24,56,26],
       'Marks':[88,76,90,85,79,95],
       'City':['Delhi','Noida','Mumbai','Chennai','Kolkata','Bangalore']
       }
dataframe = pd.DataFrame(dic)

print(dataframe)
print(dataframe['name'][2])

     name  age  Marks       City
0  Ashish   22     88      Delhi
1     Dev   33     76      Noida
2   Ankit   41     90     Mumbai
3   Anmol   24     85    Chennai
4   Vivek   56     79    Kolkata
5   Akash   26     95  Bangalore
Ankit

In [25]:
list1 = [[1,2,3,4,5],[6,7,8,4,6]]
dataframe = pd.DataFrame(list1)

print(dataframe)

   0  1  2  3  4
0  1  2  3  4  5
1  6  7  8  4  6

## Arithmetic operation

In [ ]:
var = pd.DataFrame({"A":[1,2,3],"B":[4,5,6],"C":[7,8,9]})
var

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [ ]:
var = pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})
var['C'] = var['A'] + var['B'] # we can perform more operations like this on coluumns 
var

   A  B  C
0  1  4  5
1  2  5  7
2  3  6  9

Conditional operationson a data frame

In [30]:
dic = {'name':['Ashish','Dev','Ankit','Anmol','Vivek','Akash'],
       'age':[22,33,41,24,56,26],
       'Marks':[88,76,90,85,79,95],
       'City':['Delhi','Noida','Mumbai','Chennai','Kolkata','Bangalore']
       }
dataframe = pd.DataFrame(dic)
dic
dataframe['perfect'] = dataframe['age']>50
dataframe

     name  age  Marks       City  perfect
0  Ashish   22     88      Delhi    False
1     Dev   33     76      Noida    False
2   Ankit   41     90     Mumbai    False
3   Anmol   24     85    Chennai    False
4   Vivek   56     79    Kolkata     True
5   Akash   26     95  Bangalore    False

# Delete and Add data in a dataframe

In [40]:
var = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,6],"c":[5,4,3,2,1]})
var

   A  B  c
0  1  9  5
1  2  8  4
2  3  7  3
3  4  6  2
4  5  6  1

In [47]:
var.insert(1,'Math_2',[10,20,30,45,50])
var

   A  Math_2  Math_1  Math  B  c  python_12
0  1      10      10     1  9  5        1.0
1  2      20      20     2  8  4        2.0
2  3      30      30     3  7  3        3.0
3  4      45      45     4  6  2        NaN
4  5      50      50     5  6  1        NaN

In [48]:
var["python_12"] = var["A"][0:3]
var

   A  Math_2  Math_1  Math  B  c  python_12
0  1      10      10     1  9  5        1.0
1  2      20      20     2  8  4        2.0
2  3      30      30     3  7  3        3.0
3  4      45      45     4  6  2        NaN
4  5      50      50     5  6  1        NaN

## Delete

In [49]:
var_1 = var.pop("B")
var

   A  Math_2  Math_1  Math  c  python_12
0  1      10      10     1  5        1.0
1  2      20      20     2  4        2.0
2  3      30      30     3  3        3.0
3  4      45      45     4  2        NaN
4  5      50      50     5  1        NaN

In [51]:
del var["A"]
var

   Math_2  Math_1  Math  c  python_12
0      10      10     1  5        1.0
1      20      20     2  4        2.0
2      30      30     3  3        3.0
3      45      45     4  2        NaN
4      50      50     5  1        NaN

# Read CSV file and Write CSV file

Write csv file

In [56]:
d = {"A":[1,2,3,4,5,6],"B":[6,5,4,3,2,1],"C":[7,8,9,10,11,12]}
dis = pd.DataFrame(d)
print(dis)
dis.to_csv("data.csv")

   A  B   C
0  1  6   7
1  2  5   8
2  3  4   9
3  4  3  10
4  5  2  11
5  6  1  12

In [58]:
d = {"A":[1,2,3,4,5,6],"B":[6,5,4,3,2,1],"C":[7,8,9,10,11,12]}
dis = pd.DataFrame(d)
print(dis)
dis.to_csv("data.csv",index = False, header=["Column_A","Column_B","Column_C"])

   A  B   C
0  1  6   7
1  2  5   8
2  3  4   9
3  4  3  10
4  5  2  11
5  6  1  12

Read csv file

In [60]:
cv2 = pd.read_csv(r"C:\Users\LENOVO\OneDrive\Desktop\clean_stock_data.csv")
cv2

              date   open   high    low  close   volume Name
0       2013-08-02  15.07  15.12  14.63  14.75  8407500  AAL
1       2013-11-02  14.89  15.01  14.26  14.46  8882000  AAL
2       2013-12-02  14.45  14.51  14.10  14.27  8126000  AAL
3       2013-12-02  13.57  13.60  13.21  13.57  6071400  AAL
4       2013-12-02  13.60  13.76  13.00  13.02  7186400  AAL
...            ...    ...    ...    ...    ...      ...  ...
520356  2018-01-02  76.84  78.27  76.69  77.82  2982259  ZTS
520357  2018-02-02  77.53  78.12  76.73  76.78  2595187  ZTS
520358  2018-05-02  76.64  76.92  73.18  73.83  2962031  ZTS
520359  2018-06-02  72.74  74.56  72.13  73.27  4924323  ZTS
520360  2018-07-02  72.70  75.00  72.69  73.86  4534912  ZTS

[520361 rows x 7 columns]

Excess only specific columns

In [61]:
cv2 = pd.read_csv(r"C:\Users\LENOVO\OneDrive\Desktop\clean_stock_data.csv", usecols=["date","high"])
cv2

              date   high
0       2013-08-02  15.12
1       2013-11-02  15.01
2       2013-12-02  14.51
3       2013-12-02  13.60
4       2013-12-02  13.76
...            ...    ...
520356  2018-01-02  78.27
520357  2018-02-02  78.12
520358  2018-05-02  76.92
520359  2018-06-02  74.56
520360  2018-07-02  75.00

[520361 rows x 2 columns]

Skip the rows

In [63]:
cv2 = pd.read_csv(r"C:\Users\LENOVO\OneDrive\Desktop\clean_stock_data.csv", skiprows=[4])
cv2

              date   open   high    low  close   volume Name
0       2013-08-02  15.07  15.12  14.63  14.75  8407500  AAL
1       2013-11-02  14.89  15.01  14.26  14.46  8882000  AAL
2       2013-12-02  14.45  14.51  14.10  14.27  8126000  AAL
3       2013-12-02  13.60  13.76  13.00  13.02  7186400  AAL
4       2013-12-02  13.28  13.62  13.18  13.41  7390500  AAL
...            ...    ...    ...    ...    ...      ...  ...
520355  2018-01-02  76.84  78.27  76.69  77.82  2982259  ZTS
520356  2018-02-02  77.53  78.12  76.73  76.78  2595187  ZTS
520357  2018-05-02  76.64  76.92  73.18  73.83  2962031  ZTS
520358  2018-06-02  72.74  74.56  72.13  73.27  4924323  ZTS
520359  2018-07-02  72.70  75.00  72.69  73.86  4534912  ZTS

[520360 rows x 7 columns]

create a column to index

In [64]:
cv2 = pd.read_csv(r"C:\Users\LENOVO\OneDrive\Desktop\clean_stock_data.csv",index_col='date')
cv2

             open   high    low  close   volume Name
date
2013-08-02  15.07  15.12  14.63  14.75  8407500  AAL
2013-11-02  14.89  15.01  14.26  14.46  8882000  AAL
2013-12-02  14.45  14.51  14.10  14.27  8126000  AAL
2013-12-02  13.57  13.60  13.21  13.57  6071400  AAL
2013-12-02  13.60  13.76  13.00  13.02  7186400  AAL
...           ...    ...    ...    ...      ...  ...
2018-01-02  76.84  78.27  76.69  77.82  2982259  ZTS
2018-02-02  77.53  78.12  76.73  76.78  2595187  ZTS
2018-05-02  76.64  76.92  73.18  73.83  2962031  ZTS
2018-06-02  72.74  74.56  72.13  73.27  4924323  ZTS
2018-07-02  72.70  75.00  72.69  73.86  4534912  ZTS

[520361 rows x 6 columns]

Make row in the form of heading

In [65]:
cv2 = pd.read_csv(r"C:\Users\LENOVO\OneDrive\Desktop\clean_stock_data.csv", header = 2)
cv2

        2013-11-02  14.89  15.01  14.26  14.46  8882000  AAL
0       2013-12-02  14.45  14.51  14.10  14.27  8126000  AAL
1       2013-12-02  13.57  13.60  13.21  13.57  6071400  AAL
2       2013-12-02  13.60  13.76  13.00  13.02  7186400  AAL
3       2013-12-02  13.28  13.62  13.18  13.41  7390500  AAL
4       2013-12-02  13.49  13.63  13.39  13.43  6143600  AAL
...            ...    ...    ...    ...    ...      ...  ...
520354  2018-01-02  76.84  78.27  76.69  77.82  2982259  ZTS
520355  2018-02-02  77.53  78.12  76.73  76.78  2595187  ZTS
520356  2018-05-02  76.64  76.92  73.18  73.83  2962031  ZTS
520357  2018-06-02  72.74  74.56  72.13  73.27  4924323  ZTS
520358  2018-07-02  72.70  75.00  72.69  73.86  4534912  ZTS

[520359 rows x 7 columns]

Change the column rme using "name"

In [66]:
cv2 = pd.read_csv(r"C:\Users\LENOVO\OneDrive\Desktop\clean_stock_data.csv", names =['Date','Open','High','Low','Close','Volume'])
cv2

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_10276\760721756.py:1: DtypeWarning: Columns (1,2,3,4,5) have mixed types. Specify dtype option on import or set low_memory=False.
  cv2 = pd.read_csv(r"C:\Users\LENOVO\OneDrive\Desktop\clean_stock_data.csv", names =['Date','Open','High','Low','Close','Volume'])

             Date   Open   High    Low    Close Volume
date         open   high    low  close   volume   Name
2013-08-02  15.07  15.12  14.63  14.75  8407500    AAL
2013-11-02  14.89  15.01  14.26  14.46  8882000    AAL
2013-12-02  14.45  14.51   14.1  14.27  8126000    AAL
2013-12-02  13.57   13.6  13.21  13.57  6071400    AAL
...           ...    ...    ...    ...      ...    ...
2018-01-02  76.84  78.27  76.69  77.82  2982259    ZTS
2018-02-02  77.53  78.12  76.73  76.78  2595187    ZTS
2018-05-02  76.64  76.92  73.18  73.83  2962031    ZTS
2018-06-02  72.74  74.56  72.13  73.27  4924323    ZTS
2018-07-02   72.7   75.0  72.69  73.86  4534912    ZTS

[520362 rows x 6 columns]

Specific column ke dtype ko change krna

In [7]:
cv2 = pd.read_csv(r"C:\Users\LENOVO\OneDrive\Desktop\clean_stock_data.csv", dtype = {"volume":"float"})
cv2

              date   open   high    low  close     volume Name
0       2013-08-02  15.07  15.12  14.63  14.75  8407500.0  AAL
1       2013-11-02  14.89  15.01  14.26  14.46  8882000.0  AAL
2       2013-12-02  14.45  14.51  14.10  14.27  8126000.0  AAL
3       2013-12-02  13.57  13.60  13.21  13.57  6071400.0  AAL
4       2013-12-02  13.60  13.76  13.00  13.02  7186400.0  AAL
...            ...    ...    ...    ...    ...        ...  ...
520356  2018-01-02  76.84  78.27  76.69  77.82  2982259.0  ZTS
520357  2018-02-02  77.53  78.12  76.73  76.78  2595187.0  ZTS
520358  2018-05-02  76.64  76.92  73.18  73.83  2962031.0  ZTS
520359  2018-06-02  72.74  74.56  72.13  73.27  4924323.0  ZTS
520360  2018-07-02  72.70  75.00  72.69  73.86  4534912.0  ZTS

[520361 rows x 7 columns]

# Functions to change in CSV

In [8]:
cv2 = pd.read_csv(r"C:\Users\LENOVO\OneDrive\Desktop\clean_stock_data.csv")
cv2

              date   open   high    low  close   volume Name
0       2013-08-02  15.07  15.12  14.63  14.75  8407500  AAL
1       2013-11-02  14.89  15.01  14.26  14.46  8882000  AAL
2       2013-12-02  14.45  14.51  14.10  14.27  8126000  AAL
3       2013-12-02  13.57  13.60  13.21  13.57  6071400  AAL
4       2013-12-02  13.60  13.76  13.00  13.02  7186400  AAL
...            ...    ...    ...    ...    ...      ...  ...
520356  2018-01-02  76.84  78.27  76.69  77.82  2982259  ZTS
520357  2018-02-02  77.53  78.12  76.73  76.78  2595187  ZTS
520358  2018-05-02  76.64  76.92  73.18  73.83  2962031  ZTS
520359  2018-06-02  72.74  74.56  72.13  73.27  4924323  ZTS
520360  2018-07-02  72.70  75.00  72.69  73.86  4534912  ZTS

[520361 rows x 7 columns]

know about the index

In [14]:
cv2.index

RangeIndex(start=0, stop=520361, step=1)

Know about the columns

In [13]:
cv2.columns

Index(['date', 'open', 'high', 'low', 'close', 'volume', 'Name'], dtype='object')

Extract info. related to dataset

In [15]:
cv2.describe()

,open,high,low,close,volume
count,520361.000000,520361.000000,520361.000000,520361.000000,5.203610e+05
mean,68.782639,69.393746,68.170019,68.804522,2.572266e+06
std,35.410620,35.700285,35.117029,35.421472,1.991792e+06
min,1.670000,1.690000,1.650000,1.660000,0.000000e+00
25%,41.810000,42.200000,41.420000,41.830000,1.068410e+06
50%,62.540000,63.093500,62.000000,62.580000,1.936856e+06
75%,88.500000,89.240000,87.760000,88.530000,3.517128e+06
max,175.590000,177.010000,174.090000,175.650000,9.105763e+06

Get first five rows

In [16]:
cv2.head()

         date   open   high    low  close   volume Name
0  2013-08-02  15.07  15.12  14.63  14.75  8407500  AAL
1  2013-11-02  14.89  15.01  14.26  14.46  8882000  AAL
2  2013-12-02  14.45  14.51  14.10  14.27  8126000  AAL
3  2013-12-02  13.57  13.60  13.21  13.57  6071400  AAL
4  2013-12-02  13.60  13.76  13.00  13.02  7186400  AAL

Get last five rows

In [17]:
cv2.tail()

              date   open   high    low  close   volume Name
520356  2018-01-02  76.84  78.27  76.69  77.82  2982259  ZTS
520357  2018-02-02  77.53  78.12  76.73  76.78  2595187  ZTS
520358  2018-05-02  76.64  76.92  73.18  73.83  2962031  ZTS
520359  2018-06-02  72.74  74.56  72.13  73.27  4924323  ZTS
520360  2018-07-02  72.70  75.00  72.69  73.86  4534912  ZTS

Slicing on the basis of index

In [21]:
cv2[6:11]

          date   open   high    low  close   volume Name
6   2013-12-02  13.49  13.63  13.39  13.43  6143600  AAL
7   2013-01-03  13.37  13.95  13.32  13.61  7376800  AAL
8   2013-04-03  13.50  14.07  13.47  13.90  8174800  AAL
9   2013-05-03  14.01  14.05  13.71  14.05  7676100  AAL
10  2013-11-03  14.85  15.15  14.71  15.13  6961800  AAL

Sort on the basis of rows

In [23]:
cv2.sort_index(axis=0, ascending=False)

              date   open   high    low  close   volume Name
520360  2018-07-02  72.70  75.00  72.69  73.86  4534912  ZTS
520359  2018-06-02  72.74  74.56  72.13  73.27  4924323  ZTS
520358  2018-05-02  76.64  76.92  73.18  73.83  2962031  ZTS
520357  2018-02-02  77.53  78.12  76.73  76.78  2595187  ZTS
520356  2018-01-02  76.84  78.27  76.69  77.82  2982259  ZTS
...            ...    ...    ...    ...    ...      ...  ...
4       2013-12-02  13.60  13.76  13.00  13.02  7186400  AAL
3       2013-12-02  13.57  13.60  13.21  13.57  6071400  AAL
2       2013-12-02  14.45  14.51  14.10  14.27  8126000  AAL
1       2013-11-02  14.89  15.01  14.26  14.46  8882000  AAL
0       2013-08-02  15.07  15.12  14.63  14.75  8407500  AAL

[520361 rows x 7 columns]

change all the data using colum and row

getwhole the data info of a single row

In [26]:
cv2.loc[0,"Name"]="Neetesh"
cv2

              date   open   high    low  close   volume     Name        1
0       2013-08-02  15.07  15.12  14.63  14.75  8407500  Neetesh  Neetesh
1       2013-11-02  14.89  15.01  14.26  14.46  8882000      AAL      NaN
2       2013-12-02  14.45  14.51  14.10  14.27  8126000      AAL      NaN
3       2013-12-02  13.57  13.60  13.21  13.57  6071400      AAL      NaN
4       2013-12-02  13.60  13.76  13.00  13.02  7186400      AAL      NaN
...            ...    ...    ...    ...    ...      ...      ...      ...
520356  2018-01-02  76.84  78.27  76.69  77.82  2982259      ZTS      NaN
520357  2018-02-02  77.53  78.12  76.73  76.78  2595187      ZTS      NaN
520358  2018-05-02  76.64  76.92  73.18  73.83  2962031      ZTS      NaN
520359  2018-06-02  72.74  74.56  72.13  73.27  4924323      ZTS      NaN
520360  2018-07-02  72.70  75.00  72.69  73.86  4534912      ZTS      NaN

[520361 rows x 8 columns]

get limited knowledge or specific knowledge of a row

In [28]:
cv2.iloc[0,1]

np.float64(15.07)

drop function

In [29]:
cv2.drop(1,axis=1)

              date   open   high    low  close   volume     Name
0       2013-08-02  15.07  15.12  14.63  14.75  8407500  Neetesh
1       2013-11-02  14.89  15.01  14.26  14.46  8882000      AAL
2       2013-12-02  14.45  14.51  14.10  14.27  8126000      AAL
3       2013-12-02  13.57  13.60  13.21  13.57  6071400      AAL
4       2013-12-02  13.60  13.76  13.00  13.02  7186400      AAL
...            ...    ...    ...    ...    ...      ...      ...
520356  2018-01-02  76.84  78.27  76.69  77.82  2982259      ZTS
520357  2018-02-02  77.53  78.12  76.73  76.78  2595187      ZTS
520358  2018-05-02  76.64  76.92  73.18  73.83  2962031      ZTS
520359  2018-06-02  72.74  74.56  72.13  73.27  4924323      ZTS
520360  2018-07-02  72.70  75.00  72.69  73.86  4534912      ZTS

[520361 rows x 7 columns]

## handle Null Values

# dropna ad fill na

In [32]:
a = pd.read_csv(r"C:\Users\LENOVO\OneDrive\Desktop\all_stocks_5yr.csv")
df = pd.DataFrame(a)
df

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619040 rows x 7 columns]

drop whole the null data

In [33]:
df.dropna()

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619029 rows x 7 columns]

axis = 1 kya karta hai ki bo pure data se column ko delete kr deta hai jisnme nul value store hoti hai

In [34]:
df.dropna(axis=1)

              date  close    volume Name
0       2013-02-08  14.75   8407500  AAL
1       2013-02-11  14.46   8882000  AAL
2       2013-02-12  14.27   8126000  AAL
3       2013-02-13  14.66  10259500  AAL
4       2013-02-14  13.99  31879900  AAL
...            ...    ...       ...  ...
619035  2018-02-01  77.82   2982259  ZTS
619036  2018-02-02  76.78   2595187  ZTS
619037  2018-02-05  73.83   2962031  ZTS
619038  2018-02-06  73.27   4924323  ZTS
619039  2018-02-07  73.86   4534912  ZTS

[619040 rows x 4 columns]

how  = "all" ka mtlb hai ki bo pure dataset se uss row ko delete karega jisme pure row mein null value store hoti hai

In [36]:
df.dropna(how="all")

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619040 rows x 7 columns]

ess cell mein bo sari null values remove hongi jo low ke colmn mein store hai

In [38]:
df.dropna(subset=["low"])

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619032 rows x 7 columns]

esme pure dataset se null value remove hoke nay dat set mein store hota hai

In [40]:
df.dropna(inplace= True)

ess cell mein thresh ka mtlb hai ki bo jitne thresh ki value doge 1,2,3,4,5,6,......... bo column ke andar check karega null values ko delete karega uss rows ko jaha null value thresh ki value ke brabar ho

In [42]:
df.dropna(thresh=1)

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619029 rows x 7 columns]

# fill na

ye sbhi null values ko 0 se fill karega

In [43]:
df.fillna(0)

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619029 rows x 7 columns]

Fill using dic open fill hoga 0 se aur close 999 se

In [44]:
df.fillna({'open':0, 'close':999})

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619029 rows x 7 columns]

forward fill aur backward fill

In [45]:
df.fillna(method='ffill')

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_19324\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619029 rows x 7 columns]

In [46]:
df.fillna('bfill')

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619029 rows x 7 columns]

In [48]:
df.fillna(12,inplace=True)
df

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619029 rows x 7 columns]

## Replace and Interpolate

replace

In [49]:
df.replace(to_replace=12, value=999)

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619029 rows x 7 columns]

In [50]:
df.replace(to_replace="AAL", value="Neet")

              date   open   high    low  close    volume  Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  Neet
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  Neet
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  Neet
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  Neet
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  Neet
...            ...    ...    ...    ...    ...       ...   ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259   ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187   ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031   ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323   ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912   ZTS

[619029 rows x 7 columns]